/*
* websocket 十进制错误码
* */
const errorCode = {
    '0': '正确',
    '2147549185': '加载dll失败',
    '2147549186': '端口错误',
    '2147549187': 'KEY设备不存在',
    '2147549188': 'KEY连接错误',
    '2147549195': '导出公钥错误',
    '2147549203': '导出设备信息错误',
    '2147549204': '导出用户标识错误',
    '2147549210': 'UKEY文件不存在',
    '2147549218': '不支持3个（含）以上的KEY',
    '2147549220': '设备认证码长度不符合要求',
    '2147549221': '短信认证码认证失败',
    '2147549222': '管理员PIN码长度错误',
    '2147614721': 'JSON语法错误',
    '2147614722': 'websocket不支持该接口功能',
    '2147614723': 'JSON参数错误',
    '2147614724': '读印章信息错误',
    '2147614726': 'pdf文件长度太长',
    '2147614727': 'pdf文件接收失败',
    '2147614728': '读pdf文件失败',
    '2147614736': 'pdf签章失败',
    '2147614737': '一次最多支持盖100个印章',
    '2147614738': 'KEY没有连接时不支持该操作',
    '2147614739': 'KEY连接时不支持该操作',
    '2147614741': '印章系统配置文件错误',
    '2148007937': 'KEY初始化错误',
    '2148007938': 'KEY写入密钥对失败',
    '2148007939': 'KEY写入印章失败',
    '2148007940': '重置用户PIN错误',
    '2148007941': '数据长度错误，不允许该长度数据',
    '2148007942': '设备ID与初始化不一致',
    '2148007955': '设置新pin码错，修改PIN失败',
    '2148007956': '异常错误，PIN码对话框无法建立',
    '2148007957': 'PIN码对话框取消退出',
    '2148007958': '产生临时主公钥错误',
    '2148007960': '数据摘要错误',
    '2148007981': '签名错误',
    '2148007982': '验证签名错误',
    '167772196': 'PIN不正确',
    '167772197': 'PIN被锁死',
    '167772198': 'PIN无效',
    '167772199': 'PIN长度错误',
    '-1': '未知错误'
}
function getError (code) {
    let str = code.toString()
    if (!(str in errorCode)) {
        return errorCode['-1']
    } else {
        return errorCode[str]
    }
}
export default {
    errorCode,
    getError
}
